video_system/core_onvif/onvifsend/GetCurrentPreset.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
  %1
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetPreset xmlns="http://www.onvif.org/ver20/ptz/wsdl">
      <ProfileToken>%2</ProfileToken>
    </GetPreset>
  </s:Body>
</s:Envelope>